vernonet/stm32F4_prj/lrndis_inet_radio/project/app.c
#include <stdlib.h>
#include <stdio.h>
#include "usbd_rndis_core.h"
#include "usbd_usr.h"
#include "usbd_desc.h"
#include "usb_conf.h"
#include "stm32f4_discovery.h"
#include "stm32f4_discovery_lis302dl.h"
#include "lwip/init.h"
#include "lwip/tcp.h"
#include "netif/ethernet.h"
#include "lwip/memp.h"
#include "lwip/netif.h"
#include "lwip/pbuf.h"
#include "lwip/tcp.h"
#include "netif/etharp.h"
#include "time.h"
#include "lwip/priv/tcp_priv.h"

#include "usb_bsp.h"
#include "mp3dec.h"
#include "Audio.h"
#include "mp3common.h"

__ALIGN_BEGIN
USB_OTG_CORE_HANDLE USB_OTG_dev
__ALIGN_END;

static uint8_t hwaddr[6]  = {0x20,0x89,0x84,0x6A,0x96,00};
static uint8_t ipaddr[4]  = {192, 168, 137, 10};  // {192, 168, 7, 1};
static uint8_t netmask[4] = {255, 255, 255, 0};  
static uint8_t gateway[4] = {192, 168, 137, 1};  //{0, 0, 0, 0};

#define LED_ORANGE LED3
#define LED_GREEN  LED4
#define LED_RED    LED5
#define LED_BLUE   LED6
#define LINK_LED   LED_BLUE

#define MP3DECODE_IS_START  GPIOD->BSRRL  = GPIO_BSRR_BS_0  //
#define MP3DECODE_IS_COMPL  GPIOD->BSRRH  = GPIO_BSRR_BS_0

#define OTHER_WORK_IS_START  GPIOD->BSRRL  = GPIO_BSRR_BS_2
#define OTHER_WORK_IS_COMPL  GPIOD->BSRRH  = GPIO_BSRR_BS_2

#define NUMELEMENTS(x)           (sizeof(x) / sizeof((x)[0]))         //wrong

#define RCC_DMA2_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);\
                                          } while(0U)




typedef struct {                 //internet  radio stations
	 char     *name;
   uint16_t frame_sze;
	 bool     constant_frame_sze; 
   uint8_t  ipaddr[4];
	 uint16_t port;
	 char     *get;
}station;


 const station radio_st[] = {
	  {
	   .name       =  "<SomaFM - The Trip>",         //slow speed from server
     .frame_sze =  0x1a1,
	   .constant_frame_sze = true,
     .ipaddr     =  {173,239,76,149},
		 .port       =  80,
		 .get        =  "GET /thetrip-128-mp3 HTTP/1.1\r\nHost: ice2.somafm.com\r\nCache-Control: no-cache\r\n\r\n",

		},
 
    {
	   .name       =  "<KissFM>",
     .frame_sze =  0x1a2,      //or 0x1a1
	   .constant_frame_sze = false,
     .ipaddr     =  {195,95,206,14},
		 .port       =  80,
     .get        =  "GET /KissFM_Digital HTTP/1.1\r\nhost: online-kissfm2.tavrmedia.ua\r\nCache-Control: no-cache\r\n\r\n ",
		},
 
    {  
	   .name       =  "<Costa Del Mar - Chillout>",
     .frame_sze =  0x13a,//or 0x139
	   .constant_frame_sze = false,
     .ipaddr     =  {178,32,111,41},
		 .port       =  8020,
     .get        =  "GET /stream-mp3-Chill_autodj HTTP/1.1\r\nUser-Agent: Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.6) Gecko/20040413 Epiphany/1.2.1\\r\nhost: radio.cdm-radio.com\r\nCache-Control: no-cache\r\n\r\n ",
		},
 
	  {
	   .name       =  "<Rockantenne>",
     .frame_sze =  0x1a2,   //or 0x1a1
		 .constant_frame_sze = false,
     .ipaddr     =  {194,97,151,129},
		 .port       =  80,
     .get        =  "GET /rockantenne HTTP/1.0\r\nHost: mp3channels.webradio.de\r\nUser-Agent: VLC/3.0.8 LibVLC/3.0.8\r\nIcy-MetaData: 0\r\nCache-Control: no-cache\r\n\r\n ",
		},	
	
	  {                           //128kbit  Classic
	   .name       =  "<Venice Classic Radio Italia>",
     .frame_sze =  0x1a1,
		 .constant_frame_sze = true, 
     .ipaddr     =  {174,36,206,197},
		 .port       =  8000,
     .get        =  "GET /stream HTTP/1.1\r\nhost: 174.36.206.197\r\nCache-Control: no-cache\r\n\r\n ",
		},
	
		{                        //192kbit  DNB
	   .name       =  "<Different Drumz DnB Radio>",
     .frame_sze =  0x240,
		 .constant_frame_sze = true,
     .ipaddr     =  {37,187,79,93},
		 .port       =  8031,
     .get        =  "GET /stream HTTP/1.1\r\nhost: 37.187.79.93\r\nCache-Control: no-cache\r\n\r\n ",
		},
		
		{                        //128kbit  DNB
	   .name       =  "<www.innersenceradio.com>",
     .frame_sze =  0x1a1,
		 .constant_frame_sze = true,
     .ipaddr     =  {50,7,71,219},
		 .port       =  7201,
     .get        =  "GET /stream HTTP/1.1\r\nhost: 50.7.71.219\r\nCache-Control: no-cache\r\n\r\n ",
		},
		{                        //128kbit  
	   .name       =  "<OFFRadio>",
     .frame_sze =  0x1a2,
		 .constant_frame_sze = false,
     .ipaddr     =  {46,28,53,118},
		 .port       =  7062,
     .get        =  "GET /stream HTTP/1.1\r\nhost: 46.28.53.118\r\nCache-Control: no-cache\r\n\r\n ",
		},
		{                        //192kbit  
	   .name       =  "<Ambiesphere>",
     .frame_sze =  0x273,
		 .constant_frame_sze = false,
     .ipaddr     =  {139,162,245,57},
		 .port       =  8347,
     .get        =  "GET /stream HTTP/1.1\r\nhost: 139.162.245.57\r\nCache-Control: no-cache\r\n\r\n ",
		}
	};	 
 
 const station * cur_st;


	
//***********************************************************************		
//                          SETTINGS		
//***********************************************************************			
//#define STATION                innersen_st	
//#define NUM_OF_FRAMES          100  
//#define FRAME_SZE              0x1a2 		//station.frame_sze
#define LOW_TRES               70       //treshold             60
#define HIGH_TRES		           85       //treshold            80
#define NUMSTATIONS            9	
//***********************************************************************		
//                          SETTINGS		
//***********************************************************************			
		
		

//int32_t p_XYZ[3];
unsigned char AudioVol = 0x8b, AudioVol_old = 0x8b;		
bool first=true, buf_full=false, two = false, busy = false, frame_ready = false;
bool stop_recv = false, decode_err = false; 		
uint32_t num_packet=0;

struct pbuf *temp_p;
struct tcp_pcb *temp_tpcb;		
		
// MP3 Variables            
#define FILE_READ_BUFFER_SIZE (0x80*0x240)//(0x5B4*40)
#define PERCENT               (FILE_READ_BUFFER_SIZE/100)
MP3FrameInfo			mp3FrameInfo;
HMP3Decoder				hMP3Decoder;
unsigned char syncbyte[2];   //3 byte
char					file_read_buffer[FILE_READ_BUFFER_SIZE] __attribute__((section ("BUFF"))) __attribute__ ((aligned (4)));  //main buff
char					temp_read_buffer[0x1200]                __attribute__((section ("BUFF"))) __attribute__ ((aligned (4)));  //temp buff
int32_t      file_read_buffer_poz =0, file_write_buffer_poz =0;
volatile int			bytes_left, temp_bytes_left_old, bytes_left_, temp_bytes_left;
char					*read_ptr, *temp_read_ptr_old, *temp_read_ptr;

