vernonet/stm32F4_prj/lrndis_inet_radio/project/app.c
uint8_t tgl=0, sigma=0;
char temp[0x2da] __attribute__ ((aligned (4)));
DMA_InitTypeDef dma_buf, dma_buf1, dma_buf2, dma_buf3;
struct pbuf *frame;
uint16_t bytes=0;

bool button_pres = false;

// Private function prototypes
static int AudioCallback(void *context,int buffer);

struct netif netif_data;

struct tcp_pcb *testpcb;

void tcp_setup(void);
err_t tcpRecvCallback(void *arg, struct tcp_pcb *tpcb, struct pbuf *p, err_t err);

static uint8_t received[RNDIS_MTU + 14];
static int recvSize = 0;




void on_packet(const char *data, int size)
{
	  DMA2 ->LIFCR |= DMA_LIFCR_CTCIF2; // Clear interrupt flag.
		DMA2_Stream2 ->CR &= ~DMA_SxCR_EN; // Disable DMA stream.
		while (DMA2_Stream2 ->CR & DMA_SxCR_EN ) {}; // Wait for DMA stream to stop.
		DMA2_Stream2->M0AR = (uint32_t)received;     //dst
		DMA2_Stream2->PAR  = (uint32_t)data;         //src
		DMA2_Stream2->NDTR = size;	
    DMA2 ->LIFCR |= DMA_LIFCR_CTCIF2; // clear any pending (old) DMA2 Stream 2 interrupts	
    DMA2_Stream2 ->CR |= DMA_SxCR_TCIE;			
		DMA2_Stream2 ->CR |= DMA_SxCR_EN;
		//while (DMA2_Stream2->NDTR != 0) {}	
    recvSize = size;
	  if (buf_full) STM_EVAL_LEDOff(LINK_LED);
			 else STM_EVAL_LEDToggle(LINK_LED);
}


void usb_polling()
{
	  if (frame_ready)       //send last frame transmited over DMA
    {
			  ethernet_input(frame, &netif_data);
        pbuf_free(frame);
		    frame_ready = false;
        return;
    }
	
    if (recvSize == 0) 
    {
        return;
    }
    frame = pbuf_alloc(PBUF_RAW, recvSize, PBUF_POOL);
    if (frame == NULL) 
    {
        return;
    }
		while (DMA2_Stream2->NDTR != 0) {}	  // wait while on_packet exec
//		DMA2 ->LIFCR |= DMA_LIFCR_CTCIF1; // Clear interrupt flag.
//		NVIC_ClearPendingIRQ (DMA2_Stream1_IRQn); 			
		DMA2_Stream1 ->CR &= ~DMA_SxCR_EN; // Disable DMA stream.
		while (DMA2_Stream1 ->CR & DMA_SxCR_EN ) {}
		; // Wait for DMA stream to stop.
		DMA2_Stream1->M0AR = (uint32_t)frame->payload;     //dst
		DMA2_Stream1->PAR  = (uint32_t)received; //src
		DMA2_Stream1->NDTR = recvSize;	
    DMA2_Stream1 ->CR |= DMA_SxCR_TCIE;	 			
		DMA2_Stream1 ->CR |= DMA_SxCR_EN;
//		while (DMA2_Stream1->NDTR != 0) {}	  // wait while data transfer		
    frame->len = recvSize;
    recvSize = 0;
}

void frame_polling() {
	
	if (frame_ready) {
//		frame->len = recvSize;
//    recvSize = 0;
    ethernet_input(frame, &netif_data);
    pbuf_free(frame);
		frame_ready = false;
	}  
}

static int outputs = 0;

err_t output_fn(struct netif *netif, struct pbuf *p, const ip_addr_t *ipaddr)
{
    return etharp_output(netif, p, ipaddr);
}

err_t linkoutput_fn(struct netif *netif, struct pbuf *p)
{
    int i;
    struct pbuf *q;
    static char data[RNDIS_MTU + 14 + 4];
	  volatile uint32_t time;
    int size = 0;
    for (i = 0; i < 200; i++)
    {
        if (rndis_can_send()) break;
//        msleep(1);
			  time=0xffff;
			  while(time-->1) {}// {__asm("nop");}			  
    }
    for(q = p; q != NULL; q = q->next)
    {
        if (size + q->len > RNDIS_MTU + 14)
            return ERR_ARG;
        memcpy(data + size, (char *)q->payload, q->len);
        size += q->len;
    }
    if (!rndis_can_send())
        return ERR_USE;
    rndis_send(data, size);
    outputs++;
    return ERR_OK;
}

err_t netif_init_cb(struct netif *netif)
{
    LWIP_ASSERT("netif != NULL", (netif != NULL));
    netif->mtu = RNDIS_MTU;
    netif->flags = NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_LINK_UP | NETIF_FLAG_UP;
    netif->state = NULL;
    netif->name[0] = 'E';
    netif->name[1] = 'X';
    netif->linkoutput = linkoutput_fn;
    netif->output = output_fn;
    return ERR_OK;
}

#define PADDR(ptr) ((ip_addr_t *)ptr)

void init_lwip()
{
    struct netif  *netif = &netif_data;

    lwip_init();
    netif->hwaddr_len = 6;
    memcpy(netif->hwaddr, hwaddr, 6);

    netif = netif_add(netif, PADDR(ipaddr), PADDR(netmask), PADDR(gateway), NULL, netif_init_cb, ip_input);
    netif_set_default(netif);
}

void init_periph(void)
{
	  GPIO_InitTypeDef  GPIO_InitStructure;
	
    static LIS302DL_InitTypeDef accInit =
    {
        LIS302DL_LOWPOWERMODE_ACTIVE,
        LIS302DL_DATARATE_100,
        LIS302DL_XYZ_ENABLE,
        LIS302DL_FULLSCALE_2_3,
        LIS302DL_SELFTEST_NORMAL
    };

    time_init();
		
		//NVIC_SetPriority (SysTick_IRQn, 0);   //////////////////////////////////
		
    USBD_Init(&USB_OTG_dev, USB_OTG_FS_CORE_ID, &USR_desc, &usbd_rndis_cb, &USR_cb);
    rndis_rxproc = on_packet;
    STM_EVAL_PBInit(BUTTON_USER, BUTTON_MODE_GPIO);
    STM_EVAL_LEDInit(LED_ORANGE);
    STM_EVAL_LEDInit(LED_GREEN);
    STM_EVAL_LEDInit(LED_RED);
    STM_EVAL_LEDInit(LED_BLUE);
    LIS302DL_Init(&accInit);
		
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);

		/* Configure the oscil pin */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_Init(GPIOD, &GPIO_InitStructure);
		
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
		GPIO_Init(GPIOD, &GPIO_InitStructure);
}




void _InitializeAudio(unsigned int frek){
	switch(frek)
			{
			case 8000: InitializeAudio(Audio8000HzSettings);
					break;
			case 16000: InitializeAudio(Audio16000HzSettings);
					break;
			case 22050: InitializeAudio(Audio22050HzSettings);
					break;
			case 44100: InitializeAudio(Audio44100HzSettings);
					break;
			case 48000: InitializeAudio(Audio48000HzSettings);
					break;
			default:    InitializeAudio(Audio44100HzSettings);
			}   
}			

/*
 * Called by the audio driver when it is time to provide data to
 * one of the audio buffers (while the other buffer is sent to the
 * CODEC using DMA). One mp3 frame is decoded at a time and
 * provided to the audio driver.
 */
static int  AudioCallback(void *context, int buffer) {
	static int16_t audio_buffer0[0x1000];  // __attribute__((section ("BUFF")));
	static int16_t audio_buffer1[0x1000];  // __attribute__((section ("BUFF")));

	int offset, err;
	int outOfData = 0;

