vernonet/stm32F4_prj/lrndis_inet_radio/project/app.c
	int16_t *samples;
	
	if (tgl++>3) {
	    STM_EVAL_LEDOn(LED3);
	    tgl=0; 
	}
	if (buffer) {
		samples = audio_buffer0;
	} else {
		samples = audio_buffer1;
	}
	
	offset = MP3FindSyncWord((unsigned char*)temp_read_ptr, temp_bytes_left);
	temp_bytes_left -= offset;
	temp_read_ptr += offset;
	
  temp_bytes_left_old = temp_bytes_left;
	temp_read_ptr_old   = temp_read_ptr;
	
	
	UsrLog("\n\r   AudClb: wr_poz %04x rd_poz %04x bytes_left %04x ", file_write_buffer_poz, file_read_buffer_poz, bytes_left);
	
	if (stop_recv) {
	volatile int32_t delta = file_write_buffer_poz-file_read_buffer_poz;
	if (delta<0) {delta = FILE_READ_BUFFER_SIZE+delta;}
	UsrLog(" delta %d", delta/PERCENT);
		 if (delta/PERCENT<LOW_TRES)   {
				stop_recv=false;
				tcp_recved(testpcb, 0xB68);//0xB68
				UsrLog("\n\r TCP Window Update");
		 }			
	}
	
	UsrLog(" MP3Dec ERR ");

	err = MP3Decode(hMP3Decoder, (unsigned char**)&temp_read_ptr, (int*)&temp_bytes_left, samples, 0);
	STM_EVAL_LEDOff(LED3);
	if (!syncbyte[0] && !err && (temp_bytes_left_old-temp_bytes_left) == cur_st->frame_sze) {  //find the third byte in the header of frame
		syncbyte[0] = *(temp_read_ptr_old+2);
		if (!cur_st->constant_frame_sze) syncbyte[1] = syncbyte[0] - 2;
	}
	

	if (!err) UsrLog("%d ", err);


	if (0) {  //if (err) 
		/* error occurred */
		

		switch (err) {
		case ERR_MP3_INDATA_UNDERFLOW:
			outOfData = 1;
			break;
		case ERR_MP3_MAINDATA_UNDERFLOW:
			/* do nothing - next call to decode will provide more mainData */
			break;
		case ERR_MP3_FREE_BITRATE_SYNC:
		default:
			outOfData = 1;
			break;
		}
	} else {
		// no error
		MP3GetLastFrameInfo(hMP3Decoder, &mp3FrameInfo);

		// Duplicate data in case of mono to maintain playback speed
		if (mp3FrameInfo.nChans == 1) {
			for(int i = mp3FrameInfo.outputSamps;i >= 0;i--) 	{
				samples[2 * i]=samples[i];
				samples[2 * i + 1]=samples[i];
			}
			mp3FrameInfo.outputSamps *= 2;
		}
	}

	if (!outOfData) {
		ProvideAudioBuffer(samples, mp3FrameInfo.outputSamps);
	}


	if (temp_bytes_left < cur_st->frame_sze-1)  { 
		  uint16_t len, tmp_sze = sizeof temp_read_buffer - temp_bytes_left;
		  uint32_t dst, src;
		  memmove(temp_read_buffer, &temp_read_buffer[tmp_sze], temp_bytes_left); 
		  if (tmp_sze <= FILE_READ_BUFFER_SIZE-file_read_buffer_poz) {
		      //memcpy(&temp_read_buffer[temp_bytes_left], read_ptr, tmp_sze);
				  dst = (uint32_t)&temp_read_buffer[temp_bytes_left];
				  src = (uint32_t)read_ptr;
				  len = tmp_sze;
				  file_read_buffer_poz += tmp_sze; 
			}
			 else {
				  memcpy(&temp_read_buffer[temp_bytes_left], read_ptr, FILE_READ_BUFFER_SIZE-file_read_buffer_poz);
				  //memcpy(&temp_read_buffer[temp_bytes_left+(FILE_READ_BUFFER_SIZE-file_read_buffer_poz)], file_read_buffer, tmp_sze-(FILE_READ_BUFFER_SIZE-file_read_buffer_poz));
				  dst = (uint32_t)&temp_read_buffer[temp_bytes_left+(FILE_READ_BUFFER_SIZE-file_read_buffer_poz)];
				  src = (uint32_t)&file_read_buffer[0];
				  len = tmp_sze-(FILE_READ_BUFFER_SIZE-file_read_buffer_poz);
				  file_read_buffer_poz = tmp_sze-(FILE_READ_BUFFER_SIZE-file_read_buffer_poz);
			 }
		  
      //memcpy replace
      DMA2 ->LIFCR |= DMA_LIFCR_CTCIF3; // Clear interrupt flag.
			DMA2_Stream3 ->CR &= ~DMA_SxCR_EN; // Disable DMA stream.
			while (DMA2_Stream3 ->CR & DMA_SxCR_EN ) {}
			; // Wait for DMA stream to stop.
			DMA2_Stream3->M0AR = dst;     //dst
			DMA2_Stream3->PAR  = src;                       //src  
			DMA2_Stream3->NDTR = len;	
			DMA2_Stream3 ->CR |= DMA_SxCR_TCIE;	
			DMA2_Stream3 ->CR |= DMA_SxCR_EN;			

      read_ptr = &file_read_buffer[0] + file_read_buffer_poz ;
			temp_read_ptr = temp_read_buffer;					
			temp_bytes_left = sizeof temp_read_buffer;				
	}
	
		if (err && err != ERR_MP3_MAINDATA_UNDERFLOW) {
		 UsrLog("%d ", err);
	   temp_read_ptr+= (cur_st->frame_sze-1); temp_bytes_left-=(cur_st->frame_sze-1);
		 if  (temp_read_ptr >= &temp_read_buffer[0] + sizeof temp_read_buffer) {
			 temp_read_ptr = &temp_read_buffer[0];
			 temp_bytes_left = sizeof temp_read_buffer;
		 }
	}
	
	return outOfData;
	
}

//-----------------------------------debug------------------------------------

volatile int ITM_RxBuffer = ITM_RXBUFFER_EMPTY;       /* used for Debug Input */
struct __FILE {int handle;/* Add whatever you need here */};

FILE __stdout;
FILE __stdin;

int fputc(int ch, FILE *f)
{
  ITM_SendChar(ch);
  return(ch);
}

int fgetc( FILE *f) {                /* blocking */
  while (ITM_CheckChar() != 1);
  return (ITM_ReceiveChar());
}
//-----------------------------------debug------------------------------------

uint32_t tcp_send_packet(void)
{
	  err_t error;
	  uint32_t len = strlen(cur_st->get);

    /* push to buffer */
        error = tcp_write(testpcb, cur_st->get, len, TCP_WRITE_FLAG_COPY);

    if (error) {
        UsrLog("ERROR: Code: %d (tcp_send_packet :: tcp_write)\n", error);
        return 1;
    }

    /* now send */
    error = tcp_output(testpcb);
    if (error) {
        UsrLog("ERROR: Code: %d (tcp_send_packet :: tcp_output)\n", error);
        return 1;
    }
    return 0;
}


err_t tcpRecvCallback(void *arg, struct tcp_pcb *tpcb, struct pbuf *p, err_t err)
{
//	  uint16_t bytes=0;
	  uint16_t sigma=0;
	  bytes=0; 
	  //int offset;
	
    UsrLog("\n\rData recieved,  ERR -> %d\n", err);
    if (p == NULL) {
			  if (tpcb->flags & TF_FIN)  UsrLog("\n\rFinal packet!\n");
			  UsrLog(" ---------------------------------------\n");
        UsrLog("| The remote host closed the connection.|\n");
			  UsrLog(" ---------------------------------------");
        return ERR_ABRT;
    } else {
        UsrLog("Number of pbufs %d", pbuf_clen(p));
			  UsrLog("  len %04d  tot_len %04d num_pack %04d", p->len, p->tot_len, num_packet);
        if (num_packet<1) {  
					 UsrLog("Contents of pbuf %s\n", (char *)p->payload);
					 bytes = p->len; 
				}
				  else {
						//bytes=0;
						temp_p = p;
						temp_tpcb = tpcb;
						UsrLog(" write_poz %04x ", file_write_buffer_poz);
						if (1) {//if (!(buf_full))
							  if (stop_recv) {
									 UsrLog("\n\r TCP ZeroWindow  delta %x ", file_read_buffer_poz-file_write_buffer_poz);
								}
                while (DMA2_Stream0->NDTR != 0) {}	  // wait while  last transfer												 							
								if (file_write_buffer_poz + p->len > FILE_READ_BUFFER_SIZE) {  // last packet in buffer 								
									  uint32_t temp_bytes = FILE_READ_BUFFER_SIZE - file_write_buffer_poz ;								
										memcpy(&file_read_buffer[0]+file_write_buffer_poz, (char *)p->payload, temp_bytes);  //+5
										bytes = 	p->len - temp_bytes;
									  sigma = p->len - bytes;	
										file_write_buffer_poz = 0;
									 }				  									
									 else {
                         bytes = p->len;
                         //printf("\n\r bytes %03x ", bytes); 										 
									 }
									  
