vernonet/stm32F4_prj/lrndis_inet_radio/project/app.c
								    if (buf_full)  { //if (cur_st != &radio_st[0] && buf_full)
											volatile int32_t delta = file_write_buffer_poz-file_read_buffer_poz;
											if (delta<0) delta=FILE_READ_BUFFER_SIZE+delta;
											if (!stop_recv ) {  //(!stop_recv && cur_st != &radio_st[0]) {
												 if (delta/PERCENT>HIGH_TRES)  stop_recv=true;  
											}								
			             }			
								
								//memcpy(&file_read_buffer[0]+file_write_buffer_poz, (char *)p->payload, bytes);	 
								STM_EVAL_LEDOn(LED4);	 	 
								if (1) {   //if (!buf_full) {
									
											//memcpy(&file_read_buffer[0]+file_write_buffer_poz, (char *)p->payload, bytes);
											DMA2 ->LIFCR |= DMA_LIFCR_CTCIF0; // Clear interrupt flag.
											DMA2_Stream0 ->CR &= ~DMA_SxCR_EN; // Disable DMA stream.
											while (DMA2_Stream0 ->CR & DMA_SxCR_EN ) {}
											; // Wait for DMA stream to stop.
											DMA2_Stream0->M0AR = (uint32_t)&file_read_buffer[0]+file_write_buffer_poz;     //dst
											DMA2_Stream0->PAR  = (uint32_t)(char *)p->payload+sigma;                       //src  (char *)p->payload+sigma;
											DMA2_Stream0->NDTR = bytes;	
											//DMA_Cmd(DMA2_Stream0, ENABLE);
											DMA2_Stream0 ->CR |= DMA_SxCR_TCIE;	
											DMA2_Stream0 ->CR |= DMA_SxCR_EN;										
								}

								uint16_t temp_cnt;
                if (cur_st == &radio_st[0]) temp_cnt = 0x2200;  //1200
								    else temp_cnt = 30*cur_st->frame_sze;
								if (file_write_buffer_poz > FILE_READ_BUFFER_SIZE-temp_cnt)  { //0x1200  0x6000
									 buf_full=true;  //0x600
								}							
					}
				}
				
				if (tpcb->flags & TF_ACK_NOW)  {
					UsrLog("\n\rFinal packet!\n");
				}

				if (!stop_recv) tcp_recved(tpcb, p->tot_len);   //send ack   bytes   p->len
				   else tcp_recved(tpcb, 0);
				num_packet++;
				//pbuf_free(p);


				
    }

    return 0;
}

err_t connectCallback(void *arg, struct tcp_pcb *tpcb, err_t err)
{
	  if(err == ERR_OK) {
    UsrLog("\n\rConnection Established.\n");
    UsrLog("\n\rNow sending a packet\n");
    tcp_send_packet();
    return 0;
		}
		return err;
		
}

void tcp_setup(void)
{
    uint32_t data = 0xdeadbeef;
	  err_t error;

    /* create an ip */
    ip_addr_t ip;
    IP4_ADDR(&ip, cur_st->ipaddr[0],cur_st->ipaddr[1],cur_st->ipaddr[2],cur_st->ipaddr[3]);    //IP of my PHP server   somafm  //static uint8_t ipaddr[4] = {195,95,206,14};

    /* create the control block */
    testpcb = tcp_new();    //testpcb is a global struct tcp_pcb
                            // as defined by lwIP

    /* dummy data to pass to callbacks*/

    tcp_arg(testpcb, &data);

    /* register callbacks with the pcb */

    tcp_err(testpcb, NULL);
    tcp_recv(testpcb, tcpRecvCallback);
    tcp_sent(testpcb, NULL);

    /* now connect */
    error = tcp_connect(testpcb, &ip, cur_st->port, connectCallback);
		if (error != ERR_OK)  {UsrLog ("connect ERROR"); while(1){};}

}

void dma_cfg (void) {
	
		RCC_DMA2_CLK_ENABLE();
		 
		dma_buf.DMA_Channel = DMA_Channel_0;
		dma_buf.DMA_Memory0BaseAddr = (uint32_t)received;
		dma_buf.DMA_PeripheralBaseAddr = (uint32_t)(file_read_buffer); //
		dma_buf.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
		dma_buf.DMA_PeripheralDataSize = DMA_MemoryDataSize_Byte;
		dma_buf.DMA_DIR = DMA_DIR_MemoryToMemory;
		dma_buf.DMA_Mode = DMA_Mode_Normal;
		dma_buf.DMA_MemoryInc = DMA_MemoryInc_Enable;
		dma_buf.DMA_PeripheralInc = DMA_PeripheralInc_Enable;
		//dma_buf.DMA_BufferSize = sizeof received;
		dma_buf.DMA_Priority = DMA_Priority_Low;
		dma_buf.DMA_MemoryBurst = DMA_MemoryBurst_Single;
		dma_buf.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
		dma_buf.DMA_FIFOMode = DMA_FIFOMode_Enable;
		 
		DMA_Init(DMA2_Stream0, &dma_buf);
		//DMA_Cmd(DMA2_Stream0, DISABLE);
	  NVIC_SetPriority(DMA2_Stream0_IRQn, 12);
		NVIC_EnableIRQ (DMA2_Stream0_IRQn); 	
			
		dma_buf1.DMA_Channel = DMA_Channel_0;
		dma_buf1.DMA_Memory0BaseAddr = (uint32_t)received;
		dma_buf1.DMA_PeripheralBaseAddr = (uint32_t)(temp); //
		dma_buf1.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
		dma_buf1.DMA_PeripheralDataSize = DMA_MemoryDataSize_Byte;
		dma_buf1.DMA_DIR = DMA_DIR_MemoryToMemory;
		dma_buf1.DMA_Mode = DMA_Mode_Normal;
		dma_buf1.DMA_MemoryInc = DMA_MemoryInc_Enable;
		dma_buf1.DMA_PeripheralInc = DMA_PeripheralInc_Enable;
		//dma_buf1.DMA_BufferSize = sizeof received;
		dma_buf1.DMA_Priority = DMA_Priority_Medium;
		dma_buf1.DMA_MemoryBurst = DMA_MemoryBurst_Single;
		dma_buf1.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
		dma_buf1.DMA_FIFOMode = DMA_FIFOMode_Enable;
		 
		DMA_Init(DMA2_Stream1, &dma_buf1);
    NVIC_SetPriority(DMA2_Stream1_IRQn, 11);		
		NVIC_EnableIRQ (DMA2_Stream1_IRQn); 


		dma_buf2.DMA_Channel = DMA_Channel_0;
		dma_buf2.DMA_Memory0BaseAddr = (uint32_t)received;
		dma_buf2.DMA_PeripheralBaseAddr = (uint32_t)(temp); //
		dma_buf2.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
		dma_buf2.DMA_PeripheralDataSize = DMA_MemoryDataSize_Byte;
		dma_buf2.DMA_DIR = DMA_DIR_MemoryToMemory;
		dma_buf2.DMA_Mode = DMA_Mode_Normal;
		dma_buf2.DMA_MemoryInc = DMA_MemoryInc_Enable;
		dma_buf2.DMA_PeripheralInc = DMA_PeripheralInc_Enable;
		//dma_buf1.DMA_BufferSize = sizeof received;
		dma_buf2.DMA_Priority = DMA_Priority_High;
		dma_buf2.DMA_MemoryBurst = DMA_MemoryBurst_Single;
		dma_buf2.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
		dma_buf2.DMA_FIFOMode = DMA_FIFOMode_Enable;
		 
		DMA_Init(DMA2_Stream2, &dma_buf2);
		NVIC_SetPriority(DMA2_Stream2_IRQn, 10);
		NVIC_EnableIRQ (DMA2_Stream2_IRQn); 
		
		
		dma_buf3.DMA_Channel = DMA_Channel_0;
		dma_buf3.DMA_Memory0BaseAddr = (uint32_t)received;
		dma_buf3.DMA_PeripheralBaseAddr = (uint32_t)(temp); //
		dma_buf3.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
		dma_buf3.DMA_PeripheralDataSize = DMA_MemoryDataSize_Byte;
		dma_buf3.DMA_DIR = DMA_DIR_MemoryToMemory;
		dma_buf3.DMA_Mode = DMA_Mode_Normal;
		dma_buf3.DMA_MemoryInc = DMA_MemoryInc_Enable;
		dma_buf3.DMA_PeripheralInc = DMA_PeripheralInc_Enable;
		//dma_buf1.DMA_BufferSize = sizeof received;
		dma_buf3.DMA_Priority = DMA_Priority_High;
		dma_buf3.DMA_MemoryBurst = DMA_MemoryBurst_Single;
		dma_buf3.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
		dma_buf3.DMA_FIFOMode = DMA_FIFOMode_Enable;
		 
