vernonet/stm32F4_prj/lrndis_inet_radio/project/app.c
		DMA_Init(DMA2_Stream3, &dma_buf3);
//		NVIC_SetPriority(DMA2_Stream3_IRQn, 10);
//		NVIC_EnableIRQ (DMA2_Stream3_IRQn); 

}


void DMA2_Stream2_IRQHandler (void)          //end of copy on_packet
{
	  DMA2 ->LIFCR |= DMA_LIFCR_CTCIF2; // Clear interrupt flag.
	  NVIC_ClearPendingIRQ (DMA2_Stream2_IRQn); 		
}

void DMA2_Stream1_IRQHandler (void)
{
	  DMA2 ->LIFCR |= DMA_LIFCR_CTCIF1; // Clear interrupt flag.
	  NVIC_ClearPendingIRQ (DMA2_Stream1_IRQn); 		
	  frame_ready = true;
}


void DMA2_Stream0_IRQHandler (void)              //end of copy on tcpRecvCallback
{

	  DMA2 ->LIFCR |= DMA_LIFCR_CTCIF0; // Clear interrupt flag.
	  NVIC_ClearPendingIRQ (DMA2_Stream0_IRQn); 		
	
	  file_write_buffer_poz += bytes;
	  if (file_write_buffer_poz >= FILE_READ_BUFFER_SIZE)  file_write_buffer_poz = 0;
	  STM_EVAL_LEDOff(LED4);
}


int main(void)
{
	 int16_t temp_buffer[0x3c0];  //to STACK
	 int test, offs;
	 uint8_t station_id;
		
    init_periph();	
	  dma_cfg ();	
	  STM_EVAL_PBInit(BUTTON_USER, BUTTON_MODE_EXTI);  
    init_lwip();
    while (!netif_is_up(&netif_data)) {__asm("nop");}
		USB_OTG_BSP_mDelay(10);		
//	  while(1){
//	  if ((STM_EVAL_PBGetState(BUTTON_USER)) == 1) {break;}
//		USB_OTG_BSP_mDelay(10);
//	  }

		UsrLog("\033[2J");                           //clear screen
    station_id = 0 ;
		cur_st =  &radio_st[station_id];
		USB_OTG_BSP_mDelay(6000);
		printf("\n Connect to - ");
		printf("%s",cur_st->name);
		//printf("\n\r");
		temp_bytes_left = sizeof temp_read_buffer;
		file_write_buffer_poz = 0;
		
		tcp_setup();
		
    while (1)
    {
        usb_polling();     /* usb device polling */
				if (buf_full && first) { 
					  first = false;				
					  hMP3Decoder = MP3InitDecoder();		
						InitializeAudio(Audio44100HzSettings);
						SetAudioVolume(0);
					  memcpy(temp_read_buffer, file_read_buffer, sizeof temp_read_buffer);
						//read_ptr = file_read_buffer;
					  temp_read_ptr = &temp_read_buffer[0];
					  file_read_buffer_poz = sizeof temp_read_buffer;
					  //read_ptr_old = file_read_buffer;
					  temp_bytes_left = sizeof temp_read_buffer;
					  //bytes_left_old = FILE_READ_BUFFER_SIZE;
						test = sizeof temp_buffer;
						offs = MP3FindSyncWord((unsigned char*)temp_read_ptr, test);
						temp_read_ptr += offs;
						MP3Decode(hMP3Decoder, (unsigned char**)&temp_read_ptr, (int*)&test, &temp_buffer[0], 0); //detect samplerate 
						StopAudio();
					  read_ptr = &file_read_buffer[sizeof temp_read_buffer];
					  file_read_buffer_poz = sizeof temp_read_buffer;
					  temp_read_ptr = &temp_read_buffer[0];
						MP3GetLastFrameInfo(hMP3Decoder, &mp3FrameInfo);
						_InitializeAudio(((MP3DecInfo *)hMP3Decoder)->samprate);  
					  //printf("\n\r");
						printf(" (%iHz", ((MP3DecInfo *)hMP3Decoder)->samprate);  
						printf("  %ikbps)", ((MP3DecInfo *)hMP3Decoder)->bitrate/1000); 										
						printf("\n\r");
						AudioVol = 0x8d;
						AudioVol_old = AudioVol;
						SetAudioVolume(AudioVol);  //0xAF  0x8a  0x9c
						//__disable_irq();
						PlayAudioWithCallback(AudioCallback, 0);				  
				}
				
	   if (button_pres) {                //next station
			   StopAudioDMA();
     		 // Re-initialize and set volume to avoid noise
		     InitializeAudio(Audio44100HzSettings);
		     SetAudioVolume(0);
				 buf_full = 0;
				 first = 1;
			   stop_recv = false;
			   station_id++;
			   if (station_id>NUMSTATIONS-1) station_id=0;
				 cur_st =  &radio_st[station_id];		
				 syncbyte[0] = 0;//
				 syncbyte[1] = 0;
				 printf("\n\r Connect to - ");
				 printf("%s",cur_st->name);
				 temp_bytes_left = sizeof temp_read_buffer;
				 file_write_buffer_poz = 0;		
			   num_packet = 0;
				 tcp_setup();
				 button_pres = false;			 
		 }
				
				

     
//		if ((sequen & 0x7) == 0x7) {
//		sequen = 0;	
//    BSP_ACCELERO_GetXYZ(&p_XYZ[0]);
//		if ((p_XYZ[0]> 200) && (AudioVol<0xB0)) AudioVol ++;  //sound volume
//		if ((p_XYZ[0]<-200) && (AudioVol>0x50)) AudioVol --;
//    if (AudioVol_old != AudioVol)		SetAudioVolume(AudioVol);
//	  AudioVol_old = AudioVol; 
//		}
//		UsrLog(" p_XYZ[0] %x ",p_XYZ[0] );   
     	
    }
}
